package Algorithm_C_day9;
/*트리의 부모 찾기

 * 문제
루트 없는 트리가 주어진다.
이때, 트리의 루트를 1이라고 정했을 때,
 각 노드의 부모를 구하는 프로그램을 작성하시오.

입력
첫째 줄에 노드의 개수 N (2 ≤ N ≤ 100,000)이 주어진다.
둘째 줄부터 N-1개의 줄에 트리 상에서 연결된 두 정점이 주어진다.

출력
첫째 줄부터 N-1개의 줄에 각 노드의 부모 노드 번호를 2번 노드부터 순서대로 출력한다.*/

// 문제 이해가 안된다.
// 참고할 해답 블로그들
// https://log-laboratory.tistory.com/65
// https://dhbang.tistory.com/24
// https://velog.io/@estry/%EB%B0%B1%EC%A4%80-11725-%ED%92%80%EC%9D%B4

// 1부터 dfs로 트리를 순회하면 트리를 순회하면서 자식의 부모를 저절로 찾을 수 있다는 것
public class Main {

}
